CSI API ETABS v1
cPropFrame.GetTypeRebar Method
 Retrieves the rebar design type for the specified frame section property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeRebar(
	string Name,
	ref int MyType
)
Function GetTypeRebar (
	Name As String,
	ByRef MyType As Integer
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MyType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeRebar(Name,
	MyType)
int GetTypeRebar(
	String^ Name,
	int% MyType
)
abstract GetTypeRebar :
        Name : string *
        MyType : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property
MyType
Type: System.Int32
 This is 0, 1 or 2, indicating the rebar design type.
0 | None
1 | Column
2 | Beam
Return Value
Type: Int32
 Returns zero if the type is successfully retrieved; otherwise it returns nonzero
Remarks
 This function applies only to the following section property types. Calling this function for any other type of frame section property returns an error.
Concrete Tee
Concrete Angle
Concrete Rectangle
Concrete Circle
 A nonzero rebar type is returned only if the frame section property has a concrete material.
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace